const R = require('ramda')

const data = {
  _id: "5f89dffae3d3f577f1e767c6",
  name: "Сэр Уильям Морган Кэлли",
  occupation: "Развлекающийся Пенсионер",
  sessionCount: 22,
  experience: 0,
  portrait: "https://i.imgur.com/TJRnCHz.jpeg",
  notes: "",
  age: 56,
  date: "09.03.1793",
  martialPoints: 58,
  healthStatus: "HEALTHY",
  money: 0,
  user: {
    _id: "5ea1da567d074a1907ec71a1",
    firstName: "Sergiy",
    lastName: "Voytenko",
    username: "sergiyvoytenko",
    __typename: "User",
  },
  attributes: [
    {
      _id: "5f89dffae3d3f5f34fe767ca",
      title: "Агент",
      experience: 7,
      talents: [
        {
          _id: "5f89dffae3d3f522e4e767cc",
          title: "Скрытность",
          level: 2,
          isUsed: false,
          __typename: "Talent",
        },
        {
          _id: "5f89dffae3d3f53b3fe767cb",
          title: "Ловкость",
          level: 3,
          isUsed: false,
          __typename: "Talent",
        },
        {
          _id: "5f9f29e609eb902eddd7cc3b",
          title: "Ложь",
          level: 2,
          isUsed: false,
          __typename: "Talent",
        },
        {
          _id: "5fb1abbc52d33f7098f159a4",
          title: "Взлом Замков",
          level: 1,
          isUsed: false,
          __typename: "Talent",
        },
        {
          _id: "6060a0ff524563b30943b2e1",
          title: "Мимикрия",
          level: 1,
          isUsed: false,
          __typename: "Talent",
        },
        {
          _id: "6085d8a6524563b30943b90c",
          title: "Проворные Пальцы",
          level: 1,
          isUsed: false,
          __typename: "Talent",
        },
        {
          _id: "60ab6720524563b30943bbcd",
          title: "Внимательность",
          level: 1,
          isUsed: false,
          __typename: "Talent",
        },
      ],
      __typename: "Attribute",
    },
    {
      _id: "5f89dffae3d3f539fde767c7",
      title: "Джентльмен",
      experience: 9,
      talents: [
        {
          _id: "5f89dffae3d3f56c4ae767c9",
          title: "Дисциплина",
          level: 2,
          isUsed: false,
          __typename: "Talent",
        },
        {
          _id: "5f89dffae3d3f53ffee767c8",
          title: "Эрудиция",
          level: 1,
          isUsed: false,
          __typename: "Talent",
        },
        {
          _id: "5fc43c34dfead5308ec3e355",
          title: "Невинность",
          level: 2,
          isUsed: false,
          __typename: "Talent",
        },
        {
          _id: "607c9448524563b30943b828",
          title: "Скрытые Угрозы",
          level: 1,
          isUsed: false,
          __typename: "Talent",
        },
      ],
      __typename: "Attribute",
    },
    {
      _id: "5f89e402e3d3f5bdd0e767e6",
      title: "Философ",
      experience: 4,
      talents: [
        {
          _id: "5f89e419e3d3f502ebe767e7",
          title: "Интеллект",
          level: 2,
          isUsed: false,
          __typename: "Talent",
        },
        {
          _id: "5f89e420e3d3f57581e767e8",
          title: "Ораторство",
          level: 1,
          isUsed: false,
          __typename: "Talent",
        },
        {
          _id: "603cfeb3524563b30943afb8",
          title: "Языкознание",
          level: 1,
          isUsed: false,
          __typename: "Talent",
        },
        {
          _id: "606b1803524563b30943b4dc",
          title: "Анализ Информации",
          level: 3,
          isUsed: false,
          __typename: "Talent",
        },
      ],
      __typename: "Attribute",
    },
    {
      _id: "5fd696d9eb6b8b5f8970292f",
      title: "Теневой Игрок",
      experience: 7,
      talents: [
        {
          _id: "5fd69dfeeb6b8b5f89702948",
          title: "Теневые Ведомости",
          level: 2,
          isUsed: false,
          __typename: "Talent",
        },
        {
          _id: "5fd69e2eeb6b8b5f89702949",
          title: "Интриги",
          level: 1,
          isUsed: false,
          __typename: "Talent",
        },
        {
          _id: "603d0224524563b30943afc3",
          title: "Паранойя",
          level: 1,
          isUsed: false,
          __typename: "Talent",
        },
        {
          _id: "606b0a6c524563b30943b4b7",
          title: "Допрос",
          level: 1,
          isUsed: false,
          __typename: "Talent",
        },
      ],
      __typename: "Attribute",
    },
    {
      _id: "6058c7c1524563b30943b208",
      title: "Экспедиционер",
      experience: 1,
      talents: [
        {
          _id: "6058c7db524563b30943b209",
          title: "Атлетика",
          level: 1,
          isUsed: false,
          __typename: "Talent",
        },
        {
          _id: "6058c7e1524563b30943b20a",
          title: "Ориентирование",
          level: 1,
          isUsed: false,
          __typename: "Talent",
        },
        {
          _id: "607c95c1524563b30943b82e",
          title: "Стойкость",
          level: 2,
          isUsed: false,
          __typename: "Talent",
        },
        {
          _id: "60ec1f92fc8854ca523a473f",
          title: "Лазанье",
          level: 1,
          isUsed: false,
          __typename: "Talent",
        },
      ],
      __typename: "Attribute",
    },
    {
      _id: "6092f784524563b30943b9e4",
      title: "Немолодой Повеса",
      experience: 4,
      talents: [
        {
          _id: "6092f790524563b30943b9e5",
          title: "Кутеж",
          level: 1,
          isUsed: false,
          __typename: "Talent",
        },
        {
          _id: "6092f922524563b30943b9f1",
          title: "Азартные Игры",
          level: 1,
          isUsed: false,
          __typename: "Talent",
        },
      ],
      __typename: "Attribute",
    },
    {
      _id: "60d076bf524563b30943bfb7",
      title: "Расхититель Неземного",
      experience: 2,
      talents: [
        {
          _id: "60d076d1524563b30943bfb8",
          title: "Знание Запретных Ремесел",
          level: 1,
          isUsed: false,
          __typename: "Talent",
        },
        {
          _id: "60d076da524563b30943bfb9",
          title: "Знание Артефактов",
          level: 1,
          isUsed: false,
          __typename: "Talent",
        },
        {
          _id: "60d076e7524563b30943bfba",
          title: "Специалист по Ловушкам",
          level: 1,
          isUsed: false,
          __typename: "Talent",
        },
      ],
      __typename: "Attribute",
    },
  ],
  negativeTraits: [
    {
      _id: "5f89e43fe3d3f5b64ee767e9",
      title: "Седина в бороду - бес в ребро",
      level: 3,
      description:
        "Риск - мое второе имя, молодой человек! Я смеюсь, глядя в лицо опасности! Уильям - человек действия, готовый рисковать ради возможности доказать себе и окружающим, что он все еще чего-то стоит. Можно сказать, что сэр Кэлли идеологически тираниец, хотя ни в коей мере не почитает тирана и не имеет отношения к культу. Он просто выжимает максимум из остатка своей жизни, стараясь жить ярко, и тем самым подвергает жизнь опасности.",
      experience: 2,
      __typename: "NegativeTrait",
    },
    {
      _id: "5f89e465e3d3f50715e767ea",
      title: "Старость - не радость",
      level: 2,
      description:
        "Физические слабости. Не может долго бежать, преследовать, ноют суставы на погоду и так далее. Может, потом будет компенсировать талантами, но даже с ними все еще оставляет его стареющим.",
      experience: 0,
      __typename: "NegativeTrait",
    },
    {
      _id: "5f89e476e3d3f50080e767eb",
      title: "Век живи - век учись",
      level: 2,
      description:
        "Ценит знания, всех поучает сам, считает, что нужно саморазвиваться (и иначе - никак) и учиться новому. Будет рисковать ради ценных знаний, книг, шпионской и стратегический инфы.",
      experience: 4,
      __typename: "NegativeTrait",
    },
    {
      _id: "5f89e4a2e3d3f504ece767ec",
      title: "Ума - палата, да ключ потерян",
      level: 1,
      description:
        "Неуместные шутки или слишком прямые для общества высказывания, самоирония и дурашливость, все социальные роскоши, которые может позволить себе стареющий джентльмен в обществе слишком чопорном, чтоб воспринимать жизнь как она есть (или какой она кажется именно Уильяму). Из-за такого поведения можно попасть в неприятные социальные передряги или прослыть дурачком, но не более.",
      experience: 0,
      __typename: "NegativeTrait",
    },
    {
      _id: "5fb2902b52d33f30bef159a8",
      title: "Сказка - ложь, да в ней намек",
      level: 1,
      description:
        "Уильям часто рассказывает разнообразные басни. Истории из жизни, которые по сути своей почти всегда являются выдумкой хитрого старика. Но иногда... иногда они вполне себе содержат кое-какую компрометирующую информацию из его прошлого.",
      experience: 6,
      __typename: "NegativeTrait",
    },
    {
      _id: "600dc2c2eb6b8b5f89703883",
      title: "Война напечет и вдов, и сирот",
      level: 1,
      description:
        "Легкий ПТСР со времен экспедиций в Сальмандию, ощущение вины за родных и близких, которых впутал в войну и которые пострадали. Воспоминания облачаются в новые формы: забота о молодых, нежелание позволить ужасам повторятся, сентиментальность...",
      experience: 3,
      __typename: "NegativeTrait",
    },
  ],
  martialArts: [
    {
      _id: "5f89dffae3d3f535cbe767cd",
      uid: "classic",
      title: "Класична Техніка",
      tier: 2,
      techniques: [
        {
          title: "АТАКУЮЧИЙ ВИПАД",
          type: "Атакуюча дія",
          cost: "4",
          effects: ["Стандартний тест", "Стандартне пошкодження"],
          __typename: "MartialTechnique",
        },
        {
          title: "КОНТРАТАКА",
          type: "Атакуюча Реакція",
          cost: "4",
          effects: ["Стандартний тест", "Стандартне пошкодження"],
          __typename: "MartialTechnique",
        },
        {
          title: "ЧИСТИЙ БЛОК",
          type: "Реакція",
          cost: "3",
          effects: ["Стандартний тест", "Відміняє дію опонента"],
          __typename: "MartialTechnique",
        },
        {
          title: "ВЗМАХ",
          type: "Атакуюча дія",
          cost: "2",
          effects: ["Стандартний тест", "Пошкодження: Поріз"],
          __typename: "MartialTechnique",
        },
        {
          title: "ПРАВИЛЬНА СТІЙКА",
          type: "Додаткова Дія",
          cost: "2",
          effects: [
            "У наступному Тесті Майстерності всі «1» прирівнюються до рангу Класичного фехтування",
          ],
          __typename: "MartialTechnique",
        },
        {
          title: "КОНТРОЛЬ ДИХАННЯ",
          type: "Додаткова Дія",
          cost: "5",
          effects: [
            "Виконується тільки коли на відстані 5 кроків відсутні вороги",
            "Якщо до кінця наступного Раунду персонаж не отримає Пошкодження, тоді він відновлює Стійкість в числі, що дорівнює його Рангу Класичного Фехтування, але не більше ніж наявна Стійкість",
            "Наступний раз Контроль Дихання можна виконати, тільки якщо Персонаж отримав Пошкодження з успішної атаки ворога",
          ],
          __typename: "MartialTechnique",
        },
      ],
      deprecated: null,
      __typename: "MartialArt",
    },
    {
      _id: "5f89dffae3d3f5ca08e767ce",
      uid: "high",
      title: "Високе Фехтування",
      tier: 1,
      techniques: [
        {
          title: "КОРОЛІВСЬКИЙ ВИПАД",
          type: "Атакуюча дія",
          cost: "5",
          effects: [
            "Стандартний тест",
            "Переворот одного наймешного кубу пошкодження",
          ],
          __typename: "MartialTechnique",
        },
        {
          title: "ДУЕТ",
          type: "Атакуюча Реакція",
          cost: "3",
          effects: [
            "Тільки як реакція на Атакуючу Дію союзника",
            "Тільки проти цілі союзника",
            "Стандартний тест",
            "Пошкодження: Поріз, наноситься до Пошкодження від атаки союзника.",
          ],
          __typename: "MartialTechnique",
        },
        {
          title: "КОНТР-ВІДПОВІДЬ",
          type: "Атакуюча Реакція",
          cost: "3",
          effects: [
            "Тільки як реакція на атакуючу реакцію своєї цілі",
            "Стандартний тест",
            "Стандартне пошкодження",
          ],
          __typename: "MartialTechnique",
        },
        {
          title: "ПРЕВЕНТИВНИЙ ВИПАД",
          type: "Атакуюча Реакція",
          cost: "4",
          effects: [
            "Стандартний тест",
            "Відміняє дію ворога",
            "Пошкодження: Поріз",
          ],
          __typename: "MartialTechnique",
        },
        {
          title: "ВИПАД ЗНЕВАГИ",
          type: "Атакуюча дія",
          cost: "2",
          effects: ["Тест майстерності на 1 D6", "Стандартне пошкодження"],
          __typename: "MartialTechnique",
        },
        {
          title: "ДВОРЯНСЬКА СТІЙКА",
          type: "Додаткова Дія",
          cost: "4 - 1/2 Високого",
          effects: [
            "Ціль наступної Атакуючої Дії або Реакції вважається як з -1 Майстерності",
          ],
          __typename: "MartialTechnique",
        },
      ],
      deprecated: null,
      __typename: "MartialArt",
    },
    {
      _id: "5f89dffae3d3f50384e767cf",
      uid: "wild",
      title: "Дикий Бій",
      tier: 4,
      techniques: [
        {
          title: "СТРІМКИЙ НАПАД",
          type: "Атакуюча дія",
          cost: "6",
          effects: [
            "Атакуючий рухається до цілі на відстань 2 X ранг Дикого Бою",
            "Не вважається Пробігом, відміна дії не відміняє рух",
            "Стандартний тест",
            "Стандартне пошкодження",
          ],
          __typename: "MartialTechnique",
        },
        {
          title: "НЕВПИННА АТАКА",
          type: "Дві атакуючих дії",
          cost: "7",
          effects: [
            "Два стандартних тести",
            "Стандартне пошкодження на кожен успіх",
          ],
          __typename: "MartialTechnique",
        },
        {
          title: "ГРУБИЙ УДАР",
          type: "Атакуюча дія",
          cost: "3",
          effects: [
            "Тест з Майстерністю, що на ранг нижча",
            "Стандартне пошкодження",
          ],
          __typename: "MartialTechnique",
        },
        {
          title: "ПОРИВ БЕРСЕРКА",
          type: "Атакуюча Реакція",
          cost: "5",
          effects: [
            "Стандартний Тест",
            "Стандартне Пошкодження",
            "Відміняє атаку супротивника, якщо виконавець наносить більше кінцевого Пошкодження",
          ],
          __typename: "MartialTechnique",
        },
        {
          title: "КЛИЧ НЕНАВИСТІ",
          type: "Фехтувальна Стійка",
          cost: "2",
          effects: [
            "Якщо наступна Атакуюча Дія чи Реакція вбиває або нокаутує ціль, тоді виконавець відновлює свою Стійкість у кількості, що дорівнює подвійному рангу майстерності Дикого Бою, але не більше максимуму за Стан Здоров’я.",
          ],
          __typename: "MartialTechnique",
        },
        {
          title: "РУХ ЗВІРА",
          type: "Додаткова Дія",
          cost: "1 + 1 за кожні 2 кроки",
          effects: [
            "Виконується одразу після власної Атакуючої Дії чи Атакуючої Реакції, що нейтралізувала ворога",
            "Виконавець може виконати рух у будь-якому напрямку, але не більше кроків, ніж його Ранг Майстерності Дикого Бою",
          ],
          __typename: "MartialTechnique",
        },
      ],
      deprecated: null,
      __typename: "MartialArt",
    },
    {
      _id: "5f89dffae3d3f52ec1e767d0",
      uid: "knight",
      title: "Лицарський Стиль",
      tier: 0,
      techniques: [
        {
          title: "СЛАВНИЙ УДАР",
          type: "Атакуюча дія",
          cost: "6",
          effects: [
            "Стандартний тест",
            "Стандартне пошкодження",
            "Результат найменшого куба на пошкодження переводиться у результат найбільшого",
          ],
          __typename: "MartialTechnique",
        },
        {
          title: "КРИВАВА ЖАТВА",
          type: "Серія атакуючих дій",
          cost: "7",
          effects: [
            "Стандартний тест",
            "Стандартне пошкодження",
            "При успіху, можна безкоштовно повторити по наступній цілі, ліміт цілей – ранг Лицарського стилю",
          ],
          __typename: "MartialTechnique",
        },
        {
          title: "УДАР СТАЛІ",
          type: "Атакуюча дія",
          cost: "3",
          effects: [
            "Тест, де можна використати свій рейтинг Броні замість Майстерності",
            "Знімає Готовність цілі, в кількості майстерності Лицарського стилю",
            "Дозволяє при успіху відштовхнути ціль точно назад на відстань до 3-трьох кроків",
          ],
          __typename: "MartialTechnique",
        },
        {
          title: "КЛЯТВА СТАЛІ",
          type: "Захисна Реакція",
          cost: "2",
          effects: [
            "Стандартний тест",
            "Бонус Броні в 1/3 Лицарського Стилю",
            "Пошкодження по персонажу зменшується вполовину",
          ],
          __typename: "MartialTechnique",
        },
        {
          title: "ТУРНІРНИЙ ЗАМАХ",
          type: "Фехтувальна Стійка",
          cost: "2",
          effects: [
            "Наступна Атакуюча Дія чи Атакуюча Реакція має Бронебій та Летальність що дорівнює половині Лицарського стилю",
          ],
          __typename: "MartialTechnique",
        },
        {
          title: "БАСТІОН",
          type: "Бонусна Дія, Реакція",
          cost: "2",
          effects: [
            "Реакція на власну Паніку",
            "Вимога: Персонаж не рухався у минулий хід та не отримував Пошкодження",
            "Персонаж із Лицарською Технікою І-ІІ рангу може відмінити Паніку Робочої Ситуації, з Технікою ІІІ-ІV – також і Виклику, з V-VI – і Межової",
          ],
          __typename: "MartialTechnique",
        },
      ],
      deprecated: null,
      __typename: "MartialArt",
    },
    {
      _id: "5f89dffae3d3f5fd65e767d1",
      uid: "khimeriya",
      title: "Химерія",
      tier: 0,
      techniques: [
        {
          title: "ПЛУТОВСЬКИЙ ВИПАД",
          type: "Атакуюча дія",
          cost: "5",
          effects: [
            "Стандартний тест",
            "Стандартне пошкодження",
            "Зменшує Готовність супротивника на D6 пунктів",
          ],
          __typename: "MartialTechnique",
        },
        {
          title: "ВИХОР",
          type: "Серія трьох Атакуючих Дії",
          cost: "8",
          effects: [
            "Три тести майстерності проти трьох різних цілей",
            "Стандартне пошкодження",
          ],
          __typename: "MartialTechnique",
        },
        {
          title: "ВТЕЧА",
          type: "Захисна Реакція",
          cost: "4",
          effects: [
            "Стандартний тест",
            "Відміняє дію супротивника",
            "Зменшує Готовність супротивника на D6 пунктів",
          ],
          __typename: "MartialTechnique",
        },
        {
          title: "ГІПНОЗ ЗМІЯ",
          type: "Атакуюча дія",
          cost: "3",
          effects: [
            "Стандартний тест",
            "Пошкодження: Поріз",
            "Ціль платить подвійну вартість Готовності за рух та Атакуючі Дії або Реакції, окрім направлених на виконавця Гіпноза Змія",
            "Ефект триває до кінця Раунда або поки ціль не покине відстань Ближнього Бою химериста",
          ],
          __typename: "MartialTechnique",
        },
        {
          title: "МІМІК",
          type: "Атакуюча дія або Реакція",
          cost: "X",
          effects: [
            "Дія або реакція, що повторює останній застосований проти виконавця прийом",
            "Вартість Міміка дорівнює вартості повторюваного прийому",
          ],
          __typename: "MartialTechnique",
        },
        {
          title: "ВІДВОЛІКАЮЧИЙ ФІНТ",
          type: "Додаткова дія",
          cost: "2",
          effects: [
            "Вартість Реакції проти наступної Атакуючої Дії персонажа дорожча на половину рангу Майстерності Химерії",
          ],
          __typename: "MartialTechnique",
        },
      ],
      deprecated: null,
      __typename: "MartialArt",
    },
    {
      _id: "5f89dffae3d3f55d81e767d2",
      uid: "infernal",
      title: "Інфернальний Бій",
      tier: 0,
      techniques: [
        {
          title: "ЕКЗЕКУЦІЯ",
          type: "Атакуюча дія",
          cost: "Х2 майстерність цілі",
          effects: [
            "Стандартний тест",
            "Ціль має бути не нокаутована та мати не більше Стійкості, аніж ранг Інфернального бою атакуючого",
            "Два Пошкодження",
            "Якщо ціль нокаутована або вбита, тоді Напруга команди екзекуційованого персонажа +1 а виконавець прийому відновлює собі 6 Стійкості",
          ],
          __typename: "MartialTechnique",
        },
        {
          title: "ТАНЕЦЬ ЗІ СМЕРТЮ",
          type: "Атакуюча дія",
          cost: "5",
          effects: [
            "Ціль має + 1 Готовності для Реакції",
            "Стандартний тест",
            "Пошкодження Фатум (-)",
          ],
          __typename: "MartialTechnique",
        },
        {
          title: "ПОКАРАННЯ",
          type: "Атакуюча Дія",
          cost: "3",
          effects: [
            "Тільки проти супротивників, що Панікують",
            "Стандартний Тест",
            "Стандартне Пошкодження",
            "Вартість наступної фехтувальної дії виконавця -1",
          ],
          __typename: "MartialTechnique",
        },
        {
          title: "ПЕКЕЛЬНА ПОСЛУГА",
          type: "Захисна Реакція",
          cost: "3",
          effects: [
            "Стандартний тест",
            "Якщо атакуючий провалює Тест Майстерності і атака не була заблокована, тоді атакуючий має виконати ту ж Атаку проти іншої цілі на відстані свого Ближнього Бою на вибір виконавця реакції",
            "Складність попадання по другій цілі зменшується на 1/2 рангу Майстерності Інфернального Бою, а також ціль не отримує Реакції.",
          ],
          __typename: "MartialTechnique",
        },
        {
          title: "ВЧИНЯЮЧИ БІЛЬ",
          type: "Атакуюча Реакція",
          cost: "2",
          effects: [
            "Стандартний тест",
            "Батальний Шок цілі +1",
            "Пошкодження: Поріз",
          ],
          __typename: "MartialTechnique",
        },
        {
          title: "АПОСТОЛ ТЕРОРУ",
          type: "Фехтувальна Стійка",
          cost: "2",
          effects: [
            "Стійка діє лише проти ворогів, у яких залишилося не більше Стійкості ніж ранг Інфернального виконавця",
            "Наступна Атакуюча Дія або Реакція надає +1 ранг Немочі на одночасну Реакцію або Атакуючу Дію цілі, або +2 ранга якщо ціль Панікує",
            "Не піднімає Неміч вище ІІІ рангу",
          ],
          __typename: "MartialTechnique",
        },
      ],
      deprecated: null,
      __typename: "MartialArt",
    },
    {
      _id: "5f89dffae3d3f5e8a5e767d3",
      uid: "shooting",
      title: "Стрільба",
      tier: 1,
      techniques: [
        {
          title: "ПОСТРІЛ",
          type: "Атакуюча дія",
          cost: "1",
          effects: ["Стандартний тест", "Повне Пошкодження"],
          __typename: "MartialTechnique",
        },
        {
          title: "ЗВЕДЕННЯ КУРКА",
          type: "Додаткова дія",
          cost: "1",
          effects: ["Дозволяє постріл"],
          __typename: "MartialTechnique",
        },
        {
          title: "ПРИЦІЛЮВАННЯ 1-5 КРОКІВ",
          type: "Додаткова дія",
          cost: "1",
          effects: ["-2 до складності прицілювання"],
          __typename: "MartialTechnique",
        },
        {
          title: "ПРИЦІЛЮВАННЯ 5-25 КРОКІВ",
          type: "Додаткова дія",
          cost: "3",
          effects: ["-2 до складності прицілювання"],
          __typename: "MartialTechnique",
        },
        {
          title: "ПРИЦІЛЮВАННЯ 26-100 КРОКІВ",
          type: "Додаткова дія",
          cost: "6",
          effects: ["-2 до складності прицілювання"],
          __typename: "MartialTechnique",
        },
        {
          title: "ПРИЦІЛЮВАННЯ 101+ КРОК",
          type: "Додаткова дія",
          cost: "12",
          effects: ["-2 до складності прицілювання"],
          __typename: "MartialTechnique",
        },
        {
          title: "ПЕРЕЗАРЯДКА",
          type: "Додаткова дія",
          cost: "X",
          effects: [
            "Вартість дії визначається відповідно до типу зброї",
            "Дозволяє постріл",
          ],
          __typename: "MartialTechnique",
        },
      ],
      deprecated: null,
      __typename: "MartialArt",
    },
    {
      _id: "5f89dffae3d3f5c442e767d4",
      uid: "throwing",
      title: "Метання",
      tier: 1,
      techniques: [
        {
          title: "КИДОК",
          type: "Атакуюча дія",
          cost: "4",
          effects: ["Стандартний тест"],
          __typename: "MartialTechnique",
        },
        {
          title: "ПРИЦІЛЮВАННЯ 1-5 КРОКІВ",
          type: "Додаткова дія",
          cost: "1",
          effects: ["-2 до складності прицілювання"],
          __typename: "MartialTechnique",
        },
        {
          title: "ПРИЦІЛЮВАННЯ 5-15 КРОКІВ",
          type: "Додаткова дія",
          cost: "3",
          effects: ["-2 до складності прицілювання"],
          __typename: "MartialTechnique",
        },
      ],
      deprecated: null,
      __typename: "MartialArt",
    },
  ],
  martialTraits: [
    {
      uid: "dual_weapon",
      title: "Дуальна Зброя",
      tier: 2,
      cost: 2,
      description:
        "Всесторонньо розвинуті джентльмени здатні вчиняти насилля як правою, так і лівою рукою",
      rule: "Персонаж більше не має штрафу за використання зброї з неосновної руки.",
      requirements: "",
      deprecated: null,
      __typename: "MartialTrait",
    },
    {
      uid: "new_personality",
      title: "Нова Людина",
      tier: 2,
      cost: 5,
      description:
        "Новий  Час  відрізняється  своїм  гуманізмом,  орієнтацією  на  науку  та  культуру,  і  безліч  видатних  осіб впливають на сучасний світ, при цьому не маючи і гадки за яку сторону слід тримати меч або мушкет.",
      rule: "Персонаж  негайно  отримує  новий  Атрибут  з  двома  Наративними  Талантами,  і  його  ліміт  Атрибутів збільшується на +1. Даний Бойовий Талант купується за 5 балів Бойового Досвіду замість стандартних 2; його неможливо позбутися Сумнівним Досвідом чи отримати за Пса Війни.",
      requirements: "",
      deprecated: null,
      __typename: "MartialTrait",
    },
    {
      uid: "warrior`s_reflex",
      title: "Рефлекс Воїна",
      tier: 2,
      cost: 2,
      description:
        "У досвідченого воїна зброя слухняніша і сама стрибає у руки.",
      rule: "Персонаж може вихоплювати власну зручно закріплену зброю зі знижкою 1 Готовності. Якщо вартість вихоплення зброї скаде 0 Готовності, тоді персонаж може вихопити її  як  частину Захисної Реакції. Додатково, Рефлекс Воїна дозволяє готувати Номер Мортале не тримаючи зброю у руках. Талант  стає  недієвим якщо у персонажа більше 12 Навантаження.",
      requirements: " наративний талант Спритність І",
      deprecated: null,
      __typename: "MartialTrait",
    },
    {
      uid: "fencing:quick_blade",
      title: "Фехтувальний Фінт — Швидкий Клинок",
      tier: 2,
      cost: 2,
      description:
        "Кожна зброя має свій секрет, певний нюанс, який успішно використовують численні фахівці по всіх бойових фронтах Земного Диску.",
      rule: "Діставання Малого Меча з піхви вартує на 1 Готовності менше. Якщо вартість даної дії стає 0, тоді Малий Меч можна дістати як частину Реакції. Кожен Фінт діє лише на певний вид зброї, що буде вказаний у його описі, надаючи бійцю додаткову опцію або перавагу. Кожен персонаж може вивчити більше одного Фехтувального Фінта: взявши цей талант вперше, боєць отримує 1 Фінт, вдруге – ще 2 Фінти, в третій раз 3 Фінти і так далі, поки він не опанує їх всі.",
      requirements: "Для: Малий Меч",
      deprecated: null,
      __typename: "MartialTrait",
    },
    {
      uid: "fencing:light_shots",
      title: "Фехтувальний Фінт — Легкі Уколи",
      tier: 2,
      cost: 2,
      description:
        "Кожна зброя має свій секрет, певний нюанс, який успішно використовують численні фахівці по всіх бойових фронтах Земного Диску.",
      rule: "Персонаж може отримати знижку в 1 Готовності на кожну першу в Раунді Атакуючу Дію або Атакуючу Реакцію малим мечем, але Обладунок його супротивника для даної атаки вважатиметься на 3 бали вищим; дана бонусна броня не пробивається Бронебійністю, але зменшується на 1 за кожен ранг наративного таланту Спритність атакуючого (наприклад, при Спритності ІІ бонусна броня буде лише +1).. Кожен Фінт діє лише на певний вид зброї, що буде вказаний у його описі, надаючи бійцю додаткову опцію або перавагу. Кожен персонаж може вивчити більше одного Фехтувального Фінта: взявши цей талант вперше, боєць отримує 1 Фінт, вдруге – ще 2 Фінти, в третій раз 3 Фінти і так далі, поки він не опанує їх всі.",
      requirements: "Для: Малий Меч",
      deprecated: null,
      __typename: "MartialTrait",
    },
    {
      uid: "fencing:goon",
      title: "Фехтувальний Фінт — Горлоріз",
      tier: 2,
      cost: 2,
      description:
        "КУникайте спілкування із персонами, для яких напад зі спини є звичним та відпрацьованим рухом – вони не залишать вам і шансу.",
      rule: "Готуючи скритний Номер Мортале із нападом ближнього бою зі спини з кинджалом або удавкою, нападник автоматично вважає тест Підготовки успішним, хоча й досі має витратити відповідну кількість часу. Додатково, для такого Номеру Мортале нападник може ігнорувати Обладунок цілі, за виключенням якщо ціль у Повному Обладунку.",
      requirements: "Для: Кинджал, Удавка",
      deprecated: null,
      __typename: "MartialTrait",
    },
    {
      uid: "deviant_behaivor",
      title: "Девіантна Поведінка",
      tier: 3,
      cost: 3,
      description: "Що можна очікувати від божевільного? Що завгодно",
      rule: "Персонаж із Девіантною Поведінкою може позачергово діяти першим у кожному Раунді, якщо після генерації Готовності у нього її найменше з усіх учасників бою.",
      requirements: " 3 бали Глибинного Стресу",
      deprecated: null,
      __typename: "MartialTrait",
    },
    {
      uid: "finishing_off",
      title: "Добиваючий Рух",
      tier: 3,
      cost: 3,
      description:
        "Неприглядні закони війни кажуть – добивай тих, хто найбільш вразливий в цей момент.",
      rule: "Боєць отримує Перевагу проти цілей у яких нульова Стійкість чи Готовність, або які Панікують, окрім якщо боєць сам є атакованим і не виконує Атакуючу Реакцію.",
      requirements: "",
      deprecated: null,
      __typename: "MartialTrait",
    },
    {
      uid: "professionalism",
      title: "Професіоналізм",
      tier: 3,
      cost: 3,
      description:
        "У деяких професіях залишати живих свідків – ознака непрофесійності. ",
      rule: "Персонаж-професіонал отримує Фатум (-) на один з двох кидків Пошкодження успішного Номеру Мортале",
      requirements: "бойовий талант Тінь Смерті",
      deprecated: null,
      __typename: "MartialTrait",
    },
    {
      uid: "fencing_balance",
      title: "Фехтувальний Баланс",
      tier: 3,
      cost: 3,
      description:
        "Концентруючись на клинку у своїй руці, фехтувальник відкидає усе зайве, що стоїть між ним та його ворогом.",
      rule: "Персонаж може наприкінці кожного Раунду стати у одну Фехтувальну Стійку зі знижкою в 2 Готовності якщо він веде бій озброєним лише однією одноручною зброєю у одній руці. Талант стає недієвим якщо у персонажа більше 12 Навантаження або якщо він Панікує.",
      requirements: "  техніка Фехтування ІІІ, окрім Класичного Фехтування",
      deprecated: null,
      __typename: "MartialTrait",
    },
    {
      uid: "mystical_attack",
      title: "Містичний Напад",
      tier: 4,
      cost: 4,
      description:
        "Один особливий погляд може переповнити ворога недобрими передчуттями та паралізувати його у самому розпалі бою.",
      rule: "Один раз в Раунду до генерації Готовності персонаж з даним Талантом може обрати видимого ворога на відстані не більше 5 кроків і виконати Містичний Напад протилежним Тестом Струн. При успіху Містичного Нападу ворог отримує 6 Батального Шоку. Застосування Містичного Нападу вважається використанням однієї з відповідних Містичних Здібностей.",
      requirements:
        "містична здібність Маніпуляція, Бісів Трюк, Лихе Око або Ловець снів",
      deprecated: null,
      __typename: "MartialTrait",
    },
    {
      uid: "moving_target",
      title: "Рухлива Ціль",
      tier: 4,
      cost: 4,
      description:
        "Рухаючися зиґзаґами, прихиляючися при бігу та прикриваючись ворогами, досвідчені бійці збільшують свої шанси уникнути зустрічі із ворожою кулею. ",
      rule: "Складність стрільби та метання у Рухливу Ціль збільшується на +2 при Активному Русі, замість стандартних +1. Талант стає недієвим якщо у персонажа більше 12 Навантаження.",
      requirements: " наративний талант Спритність ІІ ",
      deprecated: null,
      __typename: "MartialTrait",
    },
    {
      uid: "shadow_of_death",
      title: "Тінь Смерті",
      tier: 4,
      cost: 4,
      description:
        "Відточивши ремесло душогубства до стану рефлексів, жахливі персони у найтемніших тінях сучасного світу заробляють великі криваві гроші. ",
      rule: "Виконуючи першу підготовку Номер Мортале проти цілі, що знаходиться на відстані не далі ніж 10 кроків, персонаж не витрачає часу й може одразу переходити до виконання або почату нову підготовку по звичайним правилам.",
      requirements: "наративний талант Скритність ІІ",
      deprecated: null,
      __typename: "MartialTrait",
    },
    {
      uid: "favorite_weapon",
      title: "Улюблена Зброя",
      tier: 4,
      cost: 4,
      description:
        "Згідно з різними військовими доктринами та поглядами армійських експертів, одні види зброї технічно переважають над іншими, але збройний вибір кожного бійця часто базується не на загальноприйнятих теоріях, а на суб’єктивних вподобаннях та власному досвіду",
      rule: "Персонаж обирає один вид зброї (мечі, шаблі, кинджали, пістолі, карабіни та так далі) як свою Улюблену Зброю. Раз у 12 годин ігрового часу при використанні Улюбленої Зброї боєць може заявити +1 на свій Тест Майстерності, в тому числі постфактум після кидка. Бойовий Талант Улюблена Зброя можна взяти декілька разів, обираючи додаткові види зброї як Улюблені.",
      requirements: "",
      deprecated: null,
      __typename: "MartialTrait",
    },
    {
      uid: "hound_of_war",
      title: "Пес Війни",
      tier: 5,
      cost: -13,
      description:
        "Сини й доньки війни, фахівці баталій та ремісники каліцтв – численні найманці та слуги сильних світу цього блукають Диском від одного збройного конфлікту до іншого, набуваючи все нових огидних талантів та лихих знань",
      rule: "При отриманні даного Таланту персонаж може одразу безкоштовно взяти собі Бойових Таланти: три ІІ-го рангу, два ІІІ-го та один ІV-го рангу.",
      requirements:
        "Один будь-який бойовий таланти ІІ-го рангу, два ІІІ-го та три ІV-го.",
      deprecated: null,
      __typename: "MartialTrait",
    },
    {
      uid: "without_fear",
      title: "Без Страху",
      tier: 6,
      cost: 6,
      description:
        "Коли пережив усі можливі піки жаху, боятися стає просто нудно й вульгарно.",
      rule: "Персонаж завжди вважає поточну Ситуацію на рівень легшою та має +1 на Складність атак панікуючих ворогів по собі (адже вони дуже враженні його холоднокровним виразом обличчя). Додатково, персонаж та усі його союзники в 5 кроках можуть в кінці кожного Раунду скинути по одному жетону Батального Шоку та не втрачають ефект Бойових Талантів, які стають недієвими при Паніці, навіть коли вона наступила.",
      requirements: "наративний талант Воля ІІІ або 3 Глибинного Стресу",
      deprecated: null,
      __typename: "MartialTrait",
    },
  ],
  items: [
    {
      _id: "5f89e39ee3d3f54201e767e0",
      uid: "small_tools",
      title: "Малий Набір Інструментів",
      type: "GENERAL",
      capacity: 0,
      weight: 1,
      minPrice: 2000,
      description:
        "Компактний футляр із базовими інструментами, необхідними для тої чи іншої фахової діяльності. Зручний для щоденного носіння, але із обмеженим функціоналом. ",
      effects: [],
      meta: null,
      masterworks: ["Отмычки"],
      damageType: null,
      weaponSize: null,
      armor: null,
      heavyArmor: null,
      heavyWeapon: null,
      lethal: null,
      armorPiercing: null,
      distance: null,
      difficulty: null,
      reload: null,
      misFire: null,
      ammo: null,
      hardAim: null,
      twoHanded: null,
      isWeared: true,
      deprecated: null,
      __typename: "Item",
    },
    {
      _id: "5f89e3b4e3d3f57a7ce767e1",
      uid: "pro_tools",
      title: "Професійний Набір Інструментів",
      type: "GENERAL",
      capacity: 0,
      weight: 7.5,
      minPrice: 10000,
      description:
        "Повноцінне знаряддя експертної праці, зазвичай вміщене у немалий за розміром саквояж або навіть два.",
      effects: [
        "Професійний набір інструментів рівнозначний відповідному Фракційному Атрибуту І рангу (@@ ст.), тобто, при наявності прийнятного приміщення за їх допомогою можна розгорнути невелику імпровізовану майстерню або польовий госпіталь. ",
      ],
      meta: null,
      masterworks: ["Набор для Перевоплощения"],
      damageType: null,
      weaponSize: null,
      armor: null,
      heavyArmor: null,
      heavyWeapon: null,
      lethal: null,
      armorPiercing: null,
      distance: null,
      difficulty: null,
      reload: null,
      misFire: null,
      ammo: null,
      hardAim: null,
      twoHanded: null,
      isWeared: true,
      deprecated: null,
      __typename: "Item",
    },
    {
      _id: "5f89e3c1e3d3f50bcde767e2",
      uid: "cane-sword",
      title: "Тростина-меч",
      type: "MELEE_WEAPON",
      capacity: 2,
      weight: 1,
      minPrice: 5000,
      description:
        "Елегантна тростина, у якій спить смертоносне лезо. Адже у неспокійні часи джентльмен не може дозволити собі залишитися неозброєним.",
      effects: [
        "З тростини-меча можна по звичайним правилам вихопити прихований малий меч.",
      ],
      meta: null,
      masterworks: [],
      damageType: "PARTIAL",
      weaponSize: "NORMAL",
      armor: null,
      heavyArmor: null,
      heavyWeapon: 0,
      lethal: 0,
      armorPiercing: 0,
      distance: [0],
      difficulty: null,
      reload: null,
      misFire: null,
      ammo: null,
      hardAim: null,
      twoHanded: false,
      isWeared: true,
      deprecated: null,
      __typename: "Item",
    },
    {
      _id: "5f89e3c5e3d3f52605e767e3",
      uid: "dagger",
      title: "Кинджал",
      type: "MELEE_WEAPON",
      capacity: 0.5,
      weight: 0.3,
      minPrice: 500,
      description:
        "Ніж є одним з найбільш універсальних інструментів усіх часів та народів; його можна знайти як у кишені чесного ремісника, так і за поясом головоріза. Тримайте своє лезо при собі, а чуже – від себе подалі.",
      effects: [],
      meta: ["Метальна (Х2)"],
      masterworks: ["+1 Бронебойности"],
      damageType: "FULL",
      weaponSize: "SHORT",
      armor: null,
      heavyArmor: null,
      heavyWeapon: 0,
      lethal: 0,
      armorPiercing: 0,
      distance: [0],
      difficulty: null,
      reload: null,
      misFire: null,
      ammo: null,
      hardAim: null,
      twoHanded: false,
      isWeared: true,
      deprecated: null,
      __typename: "Item",
    },
    {
      _id: "5f89e3dee3d3f5580be767e5",
      uid: "wardrobe_of_philistine_outfits",
      title: "Гардероб Міщанського Одягу",
      type: "GENERAL",
      capacity: 0,
      weight: 5,
      minPrice: 9000,
      description:
        "Набір міщанського одягу, що дозволяє отримати достатню кількість різних комбінацій для щоденного використання.",
      effects: [],
      meta: null,
      masterworks: [],
      damageType: null,
      weaponSize: null,
      armor: null,
      heavyArmor: null,
      heavyWeapon: null,
      lethal: null,
      armorPiercing: null,
      distance: null,
      difficulty: null,
      reload: null,
      misFire: null,
      ammo: null,
      hardAim: null,
      twoHanded: null,
      isWeared: true,
      deprecated: null,
      __typename: "Item",
    },
  ],
  fortitude: 12,
  infirmity: 0,
  stress: 4,
  deepStress: 3,
  focus: 16,
  mysticalAbilities: [
    {
      _id: "5fd6a2f8eb6b8b5f89702951",
      uid: "demon_trick",
      title: "Бісів Трюк",
      tier: 2,
      description:
        "За кожен ранг Бісового Трюку персонаж може використати дану здібність один раз у 12 внутрішньоігрових годин. ",
      effects: [
        {
          cost: 3,
          ability:
            "Персонаж може на один ранг зменшити складність одного тесту, пов'язаного із спритністю рук (фокуси, кишенькова крадіжка, взлам замку). При цьому, Ведучий все ще не зобов'язаний називати фінальну Складність.",
          __typename: "MysticalEffect",
        },
        {
          cost: 5,
          ability:
            "Пройшовши Тест Струн проти найскладнішого зі свідків персонаж може викликати незначну короткострокову ілюзію, наприклад, змусити світло ліхтаря миготіти химерними відтінками або свої руки опинитись у крові. Також, містик може змусити жертву повірити, що у його руках є (або відсутній) певний невеликий предмет (годинник, перепустка, кинджал). Ілюзія триває не довше 12-ти секунд.",
          __typename: "MysticalEffect",
        },
        {
          cost: 7,
          ability:
            "Окрім попередніх застосувань, містик з опозиційним Тестом Струн може використати Бісів Трюк щоб дізнатись ім'я будь-якої персони (одне з імен, під яким дана персона найбільш відома), що знаходиться не далі 5 кроків, а також щоб непомітно розрядити порохову зброю, яку він потримав у руках.",
          __typename: "MysticalEffect",
        },
      ],
      deprecated: null,
      __typename: "MysticalAbility",
    },
    {
      _id: "605880da524563b30943b207",
      uid: "superdexterity",
      title: "Надспристність",
      tier: 1,
      description:
        "Страх перед одержимими та їх надприродною силою давно володіє свідомістю неосвічених мас; з іншої сторони, агенти тіньового світу та вільні архетерики з радістю вдаються до будь-яких хитрощів, щоб отримати фізичну перевагу над своїми ворогами. Дві окремих містичних здібності що аугментують тіло, Надспритність дозволяє персонажу рухатись швидше, а Надстійкість проявляти надзвичайну витривалість та незламність. Використовуючи ці містичні здібності, персонаж отримує постфактум Бонус до кидку на відповідний Тест; у бою ці здібності використовуються один раз в раунд, де Надспритність надає Бонус до Готовності, а Надстійкість – блокує Пошкодження на розмір Бонуса.",
      effects: [
        {
          cost: 3,
          ability:
            "Ефект не помітний для людського ока, проте достатній, щоб врятувати у критичній ситуації. Здібність використовується раз у 12 годин, а Бонус складає +1.",
          __typename: "MysticalEffect",
        },
        {
          cost: 5,
          ability:
            " Аномальна швидкість або стійкість персонажа виділяє його серед інших акторів тіньового світу. Здібність використовується двічі у 12 годин, а Бонус складає +2.",
          __typename: "MysticalEffect",
        },
        {
          cost: 7,
          ability:
            " Містичне благословення робить персонажа лідер в ситуаціях, де вирішальна роль за фізичними талантами. Містична здібність використовується тричі у 12 годин, а Бонус складає +3.",
          __typename: "MysticalEffect",
        },
      ],
      deprecated: null,
      __typename: "MysticalAbility",
    },
  ],
  metamorphoses: [
    {
      _id: "5fd696f8eb6b8b5f89702935",
      uid: "wanderer's_dreams",
      title: "Сни Мандрівника",
      description:
        "Персонаж стає залежним від власних сновидінь, зникаючи в них неначе першопроходець у далеких плаваннях. ",
      tier: 1,
      effects: [
        "Персонаж має спати 12 годин в день, і його надзвичайно важко розбудити у звичайний спосіб. Якщо хтось справиться із цим завданням, тоді Сномандрівник отримає 1 Стресу через переривання своїх мандрів.",
        "Якщо сон Сномандрівника прерваний, він отримує 2 Стресу. Також, із персонажем у його мандрах трапляються дивні речі, через що треба раз у місяць робити кидок по таблиці Сномандрів.",
        "Якщо сон Сномандрівника прерваний, він отримує 3 Стресу. Також, із персонажем у його мандрах трапляються дивні речі, через що треба три рази (у різні дні) у місяць робити кидок по таблиці Сномандрів. ",
      ],
      extras: ["lunatism"],
      anchor: {
        uid: "masterpieces",
        title: "Шедеврів",
        description:
          "Носій прокляття вже володіє ключем для свого звільнення, але він захований у несвідомих глибинах розуму. Якір Шедеврів потребує від персонажа проходження творчої Вечірньої Амбіції на створення власного мистецького твору – картини, поєми, скульптури, композиції. Складність данної Амбіції дорівнює 5, 8 та 12 для І, ІІ та ІІІ рангу відповідно. Набір балів: ±3 за Наративні Таланти, ±3 за комфортність Умов, ±3 за витрачений час (мінімум 1 тиждень, +0,5 за кожні два тижні), ±3 за відіграш та ідеї.",
        effects: [""],
        deprecated: null,
        __typename: "Anchor",
      },
      deprecated: null,
      __typename: "Metamorphose",
    },
    {
      _id: "5fd69700eb6b8b5f89702936",
      uid: "person_incognito",
      title: "Персона Інкогніто",
      description:
        "Персонаж стає ходячою загадкою для навколишнього світу. Не діє на персонажів, у яких у два рази більше Струн Імаго ніж у Персони Інкогніто",
      tier: 2,
      effects: [
        "Усі короткострокові незначні контакти швидко забувають персонажа, ніби ніколи з ним і не зустрічались.",
        "Будь-які документальні згадки персонажа починають поступово псуватись або губитись. Це викликає як великі незручності, так і можливості.",
        "Люди починають через певний час втрачати пам'ять про Персону Інкогніто, забуваючи про розмови, домовленності або образи. Час від останнього контакту до забуття залежить від сили персонального зв'язку; нова зустріч повертає пам'ять",
      ],
      extras: ["forgetfulnessEffect"],
      anchor: null,
      deprecated: null,
      __typename: "Metamorphose",
    },
    {
      _id: "60585194524563b30943b203",
      uid: "evil_voices",
      title: "Лихі Голоси",
      description:
        "Тумани сповнені загублених образів та непрощених душ. Їх Голоси бентежать свідомість, штовхаючи на божевільні вчинки. З іншої сторони, чорнокнижники не рідко самостійно віддаються на волю Лихих Голосів в обмін на гротескну силу та нелюдську енергію. Раз у 12-ть годин персонаж може прислухатись до Голосів, щоб отримати постфактум Бонус до кидку на відповідний Наративний Тест, проте ціною є часткова втрата самоконтролю. Якщо за тиждень часу носій Лихих Голосів жодного разу не прислухався до них, тоді він отримує бали Стресу в кількості що дорівнює рангу Метаморфози",
      tier: 1,
      effects: [
        "Шепіт Голосів надає персонажу Бонус +1, роблячи підказки та направляючи його. Після використання персонаж декілька хвилин переживає галюцинації та не контролює власне мовлення.",
        "Божевільне натхнення персонажа переростає в Бонус +2, проте ціною стає потреба виконати простий й короткий, але лихий наказ Голосів. Вони можуть змусити персонажа вдарити свого союзника або близького компаньйона, пошкодити цінний предмет, вжити наркотичну речовину",
        "Аномалії переростають в Бонус +3, проте Персонаж цілковито віддається на волю галюцинацій та внутрішніх демонів на годину часу. Впродовж свого приступу носій Лихих Голосів вдасться до ганебною і навіть небезпечної поведінки.",
      ],
      extras: [],
      anchor: null,
      deprecated: null,
      __typename: "Metamorphose",
    },
    {
      _id: "60d06858524563b30943bf9a",
      uid: "familiar",
      title: "Фамільяр",
      description:
        "Фамільяр починає переслідувати свого господаря, потребуючи його піклування та уваги. Фамільяр ніколи не вступає в бій і рідко вмішується напряму в справи господаря, але вийнятки можливі. Фамільяр не може загинути, оскільки більше є фантомною істотою, ніж матеріальною, і завжди повертається до господаря. ",
      tier: 1,
      effects: [
        "Фамільяр зобов’язаний безпосередньо супроводжувати свого господаря половину часу, поки той бодрствує. Якщо з Фамільяром трапиться якась шкода, гопсподарь отримує д6 Стресу та 1 Мітку Безодні. ",
        "Фамільяр зобов’язаний безпосередньо супроводжувати свого господаря весь час і завжди. Якщо з Фамільяром трапиться якась шкода, гопсподарь отримує д6 Стресу та 2 Мітки Безодні.",
        "Якщо з Фамільяром трапиться якась шкода, гопсподарь отримує 3д6 Стресу та 3 Мітки Безодні. Разом з тим, Фамільяр починає напряму живитись духовною енергією свого господаря, через що число Струн Імаго останнього вважається на 1 меншим для усіх Супротивів та інших взаємодій. Втім, Фамільяр сам виступає резонатором містичних сил, і його володарь отримує +1 ранг до трьох Містичних Здібностей кола Пробуджених на свій вибір, окрім Істинної Сили, Істинного Зору та Мітки Долі. Раз в місяць тривалою нічною церемонією можна змінити одну з обраних Містичних Здібностей",
      ],
      extras: ["familiarForm"],
      anchor: null,
      deprecated: null,
      __typename: "Metamorphose",
    },
    {
      _id: "60d06863524563b30943bf9b",
      uid: "election_of_higher_powers",
      title: "Обранець Вищих Сил",
      description:
        "Персонаж привертає увагу Вищих Сил, і це не проходить для нього безслідно. Обранець отримує один випадковий Тягар, який проявляється у повній мірі тоді, коли у персонажа більше Стресу ніж йому дозволяє витримати дана Метаморфоха.",
      tier: 1,
      effects: [
        "Тягар проявляється при 7+ Стресу.",
        "Тягар проявляється при 5+ Стресу. Тягар привертає увагу релігійних осіб та служителів різноманітних культів, змушуючи їх повірити що даний Обранець має стосунок до їх власних пророцтв та святих місій; здебільшого, така увага не означає нічого доброго. ",
        "Тягар являє себе при 3+ Стресу. Разом з тим, увага Вищих Сил дозволяє Обранцю брати участь в Окультних Ритуалах в ролі Ритуального Ключа, зменшуючи Складність дійства на 2 та збільшуючи Ранг Церемоніалу для ефекту на 1; таке застосування погіршує Стан Здоров’я Обранця на ранг. Усі Метаістоти отримують Ранг Немічі на Атакуючі Дії та Наративні Тести проти Обранця. ",
      ],
      extras: ["deputyBurden"],
      anchor: null,
      deprecated: null,
      __typename: "Metamorphose",
    },
    {
      _id: "60d0686a524563b30943bf9c",
      uid: "mythical_curse",
      title: "Міфічне Прокляття",
      description:
        "Персонаж стає на межі отримання унікального прокляття. Якщо дана Метаморфоза набере усі три ранги, Ведучий має надати персонажу сюжетно або персонально тематичну унікальну аномалію, будь це перетворення на вовкулака кожне повнолуння чи пророцькі видіння сумнівного характеру. Міфічне Прокляття третього рангу також губить свій звичайний Якір, і може бути зняте лише в певний унікальний спосіб.",
      tier: 1,
      effects: [],
      extras: [],
      anchor: null,
      deprecated: null,
      __typename: "Metamorphose",
    },
  ],
  madnesses: [
    {
      uid: "passionate_speaker",
      title: "Палкий Промовець",
      type: "IDEOLOGICAL",
      description:
        "Багато жахливих речей трапляється, коли безумцю дають слово перед широкою публікою. На відміну від осіб, наділених чистим талантом оратора, бентежні промовці здатні не просто переконати своїх слухачів, вони здатні буквально втягнути натовп у власне божевілля. Раз у 12 годин Палкий Промовець може перевернути один менший куб на Наративному Тесті, пов'язаному із публічним виступом та виголошенням промови; втім, якщо результат подібного Тесту до переворотів й переводів виявився меншим за значення Стресу персонажа, тоді переворот меншого куба відбувається автоматично, не залежно від часового ліміту, а сама промова набуває радикальних закликів та крайніх тверджень, провокуючи конфлікт та розпалюючи ворожнечу.",
      deprecated: null,
      __typename: "Madness",
    },
    {
      uid: "phobia",
      title: "Фобія",
      type: "SOCIAL",
      description:
        "Жах проростає у свідомості душевнохворого, набуваючи іраціональних та непереборних форм. Для персонажа обирається сутність його Фобії, і при зустрічі з її джерелом він має пройти Тест Бентежності або запанікувати; скрутність Ситуації для Паніки визначається Ведучим, залежно від 0значимості джерела Фобії. Приклади фобій: страх темряви, страх собак або комах, страх публічності або страх крові.",
      deprecated: null,
      __typename: "Madness",
    },
    {
      uid: "paranoia",
      title: "Параноя",
      type: "CONSPIRACY",
      description:
        "Необхідна достатня уважність, щоб помічати на собі пильні погляди нібито випадкових прохожих, влювлювати ледь помітну зміну у міміці й голосі товаришів, чути тихі кроки під власними дверима пізньої ночі; необхідне достатнє божевілля, щоб зв'язати все це воєдино. Відтепер, Ведучий має таємно виконувати за даного персонажа усі Тести, пов'язані із підозрою проти інших (уважність, емпатія); якщо результат кидка, після усіх Переворотів й Переводів, буде меншим за поточне значення Стресу персонажа, тоді відповідь завжди буде в користь параної. Слова союзників будуть видаватись брехнею, випадкові свідки – шпигунами, а безлад у кімнаті – явно спричинений кимось іншим.",
      deprecated: null,
      __typename: "Madness",
    },
  ],
  injuries: [
    {
      uid: "trauma",
      title: "Ниюча Травма",
      type: "MEMORABLE",
      description:
        "Пошкодження зв'язок, суглобів та сухожилля на довгі роки залишає персонажа один на один із ниючим болем. Справжнє ж пекло починається тоді, коли за вікном планує збиратися злива. ",
      deprecated: null,
      __typename: "Injury",
    },
    {
      uid: "sex_injury",
      title: "Статеве Пошкодження",
      type: "FATAL",
      description:
        "Надзвичайно неприємна травма, що перешкоджає виконанню репродуктивних функцій персонажем. ",
      deprecated: null,
      __typename: "Injury",
    },
    {
      uid: "heavy_fracture",
      title: "Важкий Перелом",
      type: "FATAL",
      description:
        "Аналог Легкого Перелому, тільки навіть після зрощення кістка продовжує бентежити персонажа, змушуючи його шкутильгати на ногу або уникати навантаження на руку",
      deprecated: null,
      __typename: "Injury",
    },
  ],
  campaign: {
    _id: "5f89acd0e3d3f55619e76797",
    title: "Південні марки Конфедерації",
    __typename: "Campaign",
  },
  __typename: "Character",
};

const calcBB = (tier: number, coef = 1) => {
  if (tier <= 0) return 0;

  let bb = 1;
  while (tier > 1) {
    bb += tier * coef;
    tier--;
  }

  return bb;
};

const calcFencing = (traits: any[]) => {
  if (R.isEmpty(traits)) return 0;

  let length = traits.length;
  let n = 1;

  while (length - n > 0) {
    length -= n;
    n++;
  }

  return n * 2;
};

const calcCorona = (traits: any[]) => {
  if (R.isEmpty(traits)) return 0;

  const total =
    traits.length === 1
      ? traits[0].cost
      : R.sum(traits.map((g) => g.cost + 2)) - 2;

  return total;
};

export const calculateMartialTraitsBB = (mt: any[]): number => {
  if (R.isEmpty(mt)) return 0;

  const {
    fencing = [],
    corona = [],
    general = [],
  } = R.groupBy(
    (t) =>
      t.uid.includes("fencing:")
        ? "fencing"
        : t.tier > 4
        ? "corona"
        : "general",
    mt
  );

  const total =
    +R.sum(general.map((g) => g.cost)) +
    calcFencing(fencing) +
    calcCorona(corona);

  return total;
};

export const calculateMartialArtsBB = (ma: any[]): number => {
  if (R.isEmpty(ma)) return 0;

  const shooting = R.find(R.propEq("uid", "shooting"), ma);
  const throwing = R.find(R.propEq("uid", "throwing"), ma);

  const fencing = ma
    .filter((a) => a.uid !== "shooting" && a.uid !== "throwing")
    .map((f) => f.tier)
    .sort((a, b) => b - a);

  const [hFenc, ...rFenc] = fencing;

  const total =
    -3 +
    calcBB(throwing.tier) +
    calcBB(shooting.tier, 2) +
    R.sum(rFenc.map((f) => calcBB(f))) +
    calcBB(hFenc, 2);

  return total;
};

const mabb = calculateMartialArtsBB(data.martialArts);
const mtbb =  calculateMartialTraitsBB(data.martialTraits);

console.log(`${mabb} + ${mtbb} = ${mabb + mtbb}`)